import sys
input = sys.stdin.readline 

n, m = map(int, input().split())
board = [list(map(int, input().strip().split())) for _ in range(n)]

# n, m = 5, 5
# board = [[1, 2, 3, 4, 5], [5, 4, 3, 2, 1], [2, 3, 4, 5, 6], [6, 5, 4, 3, 2], [1, 2, 1, 2, 1]]
# print(board)

def solution(n, m, board): 
# 1. 직선형 (2가지)
    type1 = [
        [(0, 0), (0, 1), (0, 2), (0, 3)], 
        [(0, 0), (1, 0), (2, 0), (3, 0)]
    ] 

    # 2. 정사각형 (1가지)
    type2 = [
        [(0, 0), (0, 1), (1, 0), (1, 1)]
    ] 

    # 3. 니은(ㄴ)형 (8가지: 회전 4 + 대칭 회전 4)
    type3 = [
        [(0,0), (1,0), (2,0), (2,1)], 
        [(0,0), (1,0), (2,0), (2,-1)],
        [(0,0), (0,1), (0,2), (1,2)],
        [(0,0), (0,1), (0,2), (1,0)],
        [(0,0), (0,1), (1,1), (2,1)],
        [(0,0), (0,1), (1,0), (2,0)],
        [(0,0), (1,0), (1,1), (1,2)],
        [(0,1), (1,1), (1,0), (1,-1)]
    ]

    # 4. 시그모이드(번개)형 (4가지: 회전 2 + 대칭 회전 2)
    type4 = [
        [(0, 0), (1, 0), (1, 1), (2, 1)], 
        [(0, 0), (1, 0), (1, -1), (2, -1)],
        [(0, 0), (0, 1), (-1, 1), (-1, 2)], 
        [(0, 0), (0, 1), (1, 1), (1, 2)]
    ]

    # 5. 산(ㅜ) 형 (4가지)
    type5 = [
        [(0, 0), (0, -1), (0, 1), (1, 0)],  # ㅜ
        [(0, 0), (0, -1), (0, 1), (-1, 0)], # ㅗ
        [(0, 0), (-1, 0), (1, 0), (0, 1)],  # ㅏ
        [(0, 0), (-1, 0), (1, 0), (0, -1)]  # ㅓ
    ]

    answer = 0
    # 모든 유형에 대해 수의 최댓값 계산 
    for tp in [type1,type2,type3,type4,type5]:

        for r in range(n): 
            for c in range(m): 
                for curr_tp in tp: 
                    temp = 0
                    for dr, dc in curr_tp: 
                        nr, nc = r+dr, c+dc
                        if 0<= nr < n and 0<= nc < m: 
                            temp += board[nr][nc]
                        else: 
                            break 
                    else: 
                        if temp > answer: 
                            answer = temp
    print(answer)
                                
solution(n, m, board)